[
  {
    "image": "eventFinder.png",
    "title": "Event Finder",
    "description": "The website allows users to search for events by selecting a city and a date. It displays upcoming events happening in the chosen city on the selected dates. Users can view event details, access an interactive map showing the event location, and purchase tickets through provided links. Additionally, the site displays a 3-day weather forecast for the selected city.",
    "tech": ["React", "JavaScript", "API", "CSS", "HTML"],
    "demoLink": "https://event-finder-mu.vercel.app/",
    "repoLink": "https://github.com/Erak1t/EventFinder"
  },
  {
    "image": "projectImage2.png",
    "title": "Portfolio Website",
    "description": "A modern and responsive personal portfolio website designed to showcase my skills, experience, and projects. Built using React and Vite for optimal performance, the site features smooth animations powered by Framer Motion, a clean and intuitive layout, and a section dedicated to highlighting my key projects. The portfolio demonstrates my proficiency in front-end development and provides easy navigation for visitors to explore my work, learn about my background, and contact me for potential collaborations.",
    "tech": ["React", "Vite", "Framer Motion", "CSS", "JavaScript", "HTML"],
    "demoLink": "https://portfolio-eta-wine-24.vercel.app/",
    "repoLink": "https://github.com/Erak1t/portfolio"
  },
  {
    "image": "projectImage3.png",
    "title": "PC Shop E-commerce Website",
    "description": "A fully functional e-commerce platform for PC components, built with Next.js to ensure server-side rendering and fast performance. The store features dynamic product pages, category-based navigation, a shopping cart system, and product reviews. Styled with SCSS and Tailwind CSS for a responsive, modern UI. Integrated with Supabase for real-time database interactions and SQL queries. This project showcases my full-stack development skills, combining front-end interactivity with back-end data management, making it a practical and scalable online store solution.",
    "tech": [
      "Next.js",
      "SCSS",
      "Tailwind CSS",
      "JavaScript",
      "SQL",
      "HTML",
      "Supabase"
    ],
    "demoLink": "https://pc-shop-swart.vercel.app/",
    "repoLink": "https://github.com/Erak1t/pc-shop"
  }
]
